#include <stdio.h>

int main () {
    int n;
    scanf("%d", &n); // Ввод
    int arr[n];
    arr[0] = 0;
    arr[1] = 1; // Отмечаем Ф0 и Ф1 - это будут первые числа в закономерности "Фn = Фn-1 + Фn-2" для генерации списка

    if (n <= 1) {
        printf("%d", arr[n]); // Если номер числа - 0 или 1
    } else {
        for (int i = 2; i <= n; i++) {
            arr[i] = arr[i-1]+arr[i-2]; // Генерация списка из чисел Фиббоначи вплоть до числа n
        }
        printf("%d", arr[n]); // Вывод
    }
}